tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_IOMUXC.h
#if !defined(IOMUXC_SELECT_INPUT_T_)
#define IOMUXC_SELECT_INPUT_T_
/*!
 * @brief Enumeration for the IOMUXC select input
 *
 * Defines the enumeration for the IOMUXC select input collections.
 */
typedef enum _iomuxc_select_input
{
    kIOMUXC_CAN1_IPP_IND_CANRX_SELECT_INPUT = 0U,  /**< IOMUXC select input index */
    kIOMUXC_CAN2_IPP_IND_CANRX_SELECT_INPUT = 1U,  /**< IOMUXC select input index */
    kIOMUXC_CAN3_IPP_IND_CANRX_SELECT_INPUT = 2U,  /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_CLK_0_SELECT_INPUT = 3U,  /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_CLK_1_SELECT_INPUT = 4U,  /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DATA0_0_SELECT_INPUT = 5U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DATA0_1_SELECT_INPUT = 6U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DATA1_0_SELECT_INPUT = 7U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DATA1_1_SELECT_INPUT = 8U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DATA2_0_SELECT_INPUT = 9U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DATA2_1_SELECT_INPUT = 10U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DATA3_0_SELECT_INPUT = 11U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DATA3_1_SELECT_INPUT = 12U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DV_0_SELECT_INPUT = 13U,  /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_DV_1_SELECT_INPUT = 14U,  /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_ER_0_SELECT_INPUT = 15U,  /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_RX_ER_1_SELECT_INPUT = 16U,  /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_TX_CLK_0_SELECT_INPUT = 17U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_ECAT_TX_CLK_1_SELECT_INPUT = 18U, /**< IOMUXC select input index */
    kIOMUXC_ECAT_MDIO_DATA_IN_SELECT_INPUT = 19U,  /**< IOMUXC select input index */
    kIOMUXC_ECAT_PROM_DATA_IN_SELECT_INPUT = 20U,  /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_IPP_IND_PWMA_SELECT_INPUT_0 = 21U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_IPP_IND_PWMA_SELECT_INPUT_1 = 22U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_IPP_IND_PWMA_SELECT_INPUT_2 = 23U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_IPP_IND_PWMB_SELECT_INPUT_0 = 24U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_IPP_IND_PWMB_SELECT_INPUT_1 = 25U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM1_IPP_IND_PWMB_SELECT_INPUT_2 = 26U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM2_IPP_IND_PWMA_SELECT_INPUT_0 = 27U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM2_IPP_IND_PWMA_SELECT_INPUT_1 = 28U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM2_IPP_IND_PWMA_SELECT_INPUT_2 = 29U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM2_IPP_IND_PWMB_SELECT_INPUT_0 = 30U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM2_IPP_IND_PWMB_SELECT_INPUT_1 = 31U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM2_IPP_IND_PWMB_SELECT_INPUT_2 = 32U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM3_IPP_IND_PWMA_SELECT_INPUT_0 = 33U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM3_IPP_IND_PWMA_SELECT_INPUT_1 = 34U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM3_IPP_IND_PWMA_SELECT_INPUT_2 = 35U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM3_IPP_IND_PWMA_SELECT_INPUT_3 = 36U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM3_IPP_IND_PWMB_SELECT_INPUT_0 = 37U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM3_IPP_IND_PWMB_SELECT_INPUT_1 = 38U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM3_IPP_IND_PWMB_SELECT_INPUT_2 = 39U, /**< IOMUXC select input index */
    kIOMUXC_FLEXPWM3_IPP_IND_PWMB_SELECT_INPUT_3 = 40U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT = 41U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT = 42U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT0_SELECT_INPUT = 43U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT1_SELECT_INPUT = 44U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT2_SELECT_INPUT = 45U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT3_SELECT_INPUT = 46U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT4_SELECT_INPUT = 47U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT5_SELECT_INPUT = 48U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT6_SELECT_INPUT = 49U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT7_SELECT_INPUT = 50U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT = 51U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT = 52U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT = 53U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT0_SELECT_INPUT = 54U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT1_SELECT_INPUT = 55U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT2_SELECT_INPUT = 56U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT3_SELECT_INPUT = 57U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT0_SELECT_INPUT = 58U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT1_SELECT_INPUT = 59U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT2_SELECT_INPUT = 60U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT3_SELECT_INPUT = 61U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_SCK_FA_SELECT_INPUT = 62U, /**< IOMUXC select input index */
    kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT = 63U, /**< IOMUXC select input index */
    kIOMUXC_I3C2_PIN_SCL_IN_SELECT_INPUT = 64U,    /**< IOMUXC select input index */
    kIOMUXC_I3C2_PIN_SDA_IN_SELECT_INPUT = 65U,    /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_COL_SELECT_INPUT_0 = 66U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_COL_SELECT_INPUT_1 = 67U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_COL_SELECT_INPUT_2 = 68U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_COL_SELECT_INPUT_3 = 69U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_COL_SELECT_INPUT_4 = 70U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_COL_SELECT_INPUT_5 = 71U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_COL_SELECT_INPUT_6 = 72U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_COL_SELECT_INPUT_7 = 73U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_ROW_SELECT_INPUT_0 = 74U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_ROW_SELECT_INPUT_1 = 75U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_ROW_SELECT_INPUT_2 = 76U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_ROW_SELECT_INPUT_3 = 77U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_ROW_SELECT_INPUT_4 = 78U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_ROW_SELECT_INPUT_5 = 79U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_ROW_SELECT_INPUT_6 = 80U,  /**< IOMUXC select input index */
    kIOMUXC_KPP_IPP_IND_ROW_SELECT_INPUT_7 = 81U,  /**< IOMUXC select input index */
    kIOMUXC_LPI2C3_IPP_IND_LPI2C_SCL_SELECT_INPUT = 82U, /**< IOMUXC select input index */
    kIOMUXC_LPI2C3_IPP_IND_LPI2C_SDA_SELECT_INPUT = 83U, /**< IOMUXC select input index */
    kIOMUXC_LPI2C4_IPP_IND_LPI2C_SCL_SELECT_INPUT = 84U, /**< IOMUXC select input index */
    kIOMUXC_LPI2C4_IPP_IND_LPI2C_SDA_SELECT_INPUT = 85U, /**< IOMUXC select input index */
    kIOMUXC_LPI2C5_IPP_IND_LPI2C_SCL_SELECT_INPUT = 86U, /**< IOMUXC select input index */
    kIOMUXC_LPI2C5_IPP_IND_LPI2C_SDA_SELECT_INPUT = 87U, /**< IOMUXC select input index */
    kIOMUXC_LPI2C6_IPP_IND_LPI2C_SCL_SELECT_INPUT = 88U, /**< IOMUXC select input index */
    kIOMUXC_LPI2C6_IPP_IND_LPI2C_SDA_SELECT_INPUT = 89U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI3_IPP_IND_LPSPI_PCS_SELECT_INPUT_0 = 90U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI3_IPP_IND_LPSPI_PCS_SELECT_INPUT_1 = 91U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI3_IPP_IND_LPSPI_PCS_SELECT_INPUT_2 = 92U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI3_IPP_IND_LPSPI_PCS_SELECT_INPUT_3 = 93U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI3_IPP_IND_LPSPI_SCK_SELECT_INPUT = 94U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI3_IPP_IND_LPSPI_SDI_SELECT_INPUT = 95U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI3_IPP_IND_LPSPI_SDO_SELECT_INPUT = 96U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI4_IPP_IND_LPSPI_PCS_SELECT_INPUT_0 = 97U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI4_IPP_IND_LPSPI_SCK_SELECT_INPUT = 98U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI4_IPP_IND_LPSPI_SDI_SELECT_INPUT = 99U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI4_IPP_IND_LPSPI_SDO_SELECT_INPUT = 100U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI5_IPP_IND_LPSPI_PCS_SELECT_INPUT_0 = 101U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI5_IPP_IND_LPSPI_PCS_SELECT_INPUT_1 = 102U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI5_IPP_IND_LPSPI_PCS_SELECT_INPUT_2 = 103U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI5_IPP_IND_LPSPI_PCS_SELECT_INPUT_3 = 104U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI5_IPP_IND_LPSPI_SCK_SELECT_INPUT = 105U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI5_IPP_IND_LPSPI_SDI_SELECT_INPUT = 106U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI5_IPP_IND_LPSPI_SDO_SELECT_INPUT = 107U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI6_IPP_IND_LPSPI_PCS_SELECT_INPUT_0 = 108U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI6_IPP_IND_LPSPI_PCS_SELECT_INPUT_1 = 109U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI6_IPP_IND_LPSPI_PCS_SELECT_INPUT_2 = 110U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI6_IPP_IND_LPSPI_PCS_SELECT_INPUT_3 = 111U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI6_IPP_IND_LPSPI_SCK_SELECT_INPUT = 112U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI6_IPP_IND_LPSPI_SDI_SELECT_INPUT = 113U, /**< IOMUXC select input index */
    kIOMUXC_LPSPI6_IPP_IND_LPSPI_SDO_SELECT_INPUT = 114U, /**< IOMUXC select input index */
    kIOMUXC_LPUART10_IPP_IND_LPUART_RXD_SELECT_INPUT = 115U, /**< IOMUXC select input index */
    kIOMUXC_LPUART10_IPP_IND_LPUART_TXD_SELECT_INPUT = 116U, /**< IOMUXC select input index */
    kIOMUXC_LPUART11_IPP_IND_LPUART_RXD_SELECT_INPUT = 117U, /**< IOMUXC select input index */
    kIOMUXC_LPUART11_IPP_IND_LPUART_TXD_SELECT_INPUT = 118U, /**< IOMUXC select input index */
    kIOMUXC_LPUART3_IPP_IND_LPUART_CTS_N_SELECT_INPUT = 119U, /**< IOMUXC select input index */
    kIOMUXC_LPUART3_IPP_IND_LPUART_RXD_SELECT_INPUT = 120U, /**< IOMUXC select input index */
    kIOMUXC_LPUART3_IPP_IND_LPUART_TXD_SELECT_INPUT = 121U, /**< IOMUXC select input index */
    kIOMUXC_LPUART4_IPP_IND_LPUART_CTS_N_SELECT_INPUT = 122U, /**< IOMUXC select input index */
    kIOMUXC_LPUART5_IPP_IND_LPUART_CTS_N_SELECT_INPUT = 123U, /**< IOMUXC select input index */
    kIOMUXC_LPUART5_IPP_IND_LPUART_DCD_N_SELECT_INPUT = 124U, /**< IOMUXC select input index */
    kIOMUXC_LPUART5_IPP_IND_LPUART_DSR_N_SELECT_INPUT = 125U, /**< IOMUXC select input index */
    kIOMUXC_LPUART5_IPP_IND_LPUART_RI_N_SELECT_INPUT = 126U, /**< IOMUXC select input index */
    kIOMUXC_LPUART5_IPP_IND_LPUART_RXD_SELECT_INPUT = 127U, /**< IOMUXC select input index */
    kIOMUXC_LPUART5_IPP_IND_LPUART_TXD_SELECT_INPUT = 128U, /**< IOMUXC select input index */
    kIOMUXC_LPUART6_IPP_IND_LPUART_CTS_N_SELECT_INPUT = 129U, /**< IOMUXC select input index */
    kIOMUXC_LPUART6_IPP_IND_LPUART_DCD_N_SELECT_INPUT = 130U, /**< IOMUXC select input index */
    kIOMUXC_LPUART6_IPP_IND_LPUART_DSR_N_SELECT_INPUT = 131U, /**< IOMUXC select input index */
    kIOMUXC_LPUART6_IPP_IND_LPUART_RI_N_SELECT_INPUT = 132U, /**< IOMUXC select input index */
    kIOMUXC_LPUART6_IPP_IND_LPUART_RXD_SELECT_INPUT = 133U, /**< IOMUXC select input index */
    kIOMUXC_LPUART6_IPP_IND_LPUART_TXD_SELECT_INPUT = 134U, /**< IOMUXC select input index */
    kIOMUXC_LPUART8_IPP_IND_LPUART_CTS_N_SELECT_INPUT = 135U, /**< IOMUXC select input index */
    kIOMUXC_LPUART8_IPP_IND_LPUART_RXD_SELECT_INPUT = 136U, /**< IOMUXC select input index */
    kIOMUXC_LPUART8_IPP_IND_LPUART_TXD_SELECT_INPUT = 137U, /**< IOMUXC select input index */
    kIOMUXC_LPUART9_IPP_IND_LPUART_RXD_SELECT_INPUT = 138U, /**< IOMUXC select input index */
    kIOMUXC_LPUART9_IPP_IND_LPUART_TXD_SELECT_INPUT = 139U, /**< IOMUXC select input index */
    kIOMUXC_MIC_IPP_IND_MIC_PDM_BITSTREAM_SELECT_INPUT_0 = 140U, /**< IOMUXC select input index */
    kIOMUXC_MIC_IPP_IND_MIC_PDM_BITSTREAM_SELECT_INPUT_1 = 141U, /**< IOMUXC select input index */
    kIOMUXC_MIC_IPP_IND_MIC_PDM_BITSTREAM_SELECT_INPUT_2 = 142U, /**< IOMUXC select input index */
    kIOMUXC_MIC_IPP_IND_MIC_PDM_BITSTREAM_SELECT_INPUT_3 = 143U, /**< IOMUXC select input index */
    kIOMUXC_NETC_EMDIO_IN_SELECT_INPUT = 190U,     /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH2_COL_SELECT_INPUT = 191U,     /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH2_CRS_SELECT_INPUT = 192U,     /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH2_SLV_MDC_IN_SELECT_INPUT = 193U, /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH2_SLV_MDIO_IN_SELECT_INPUT = 194U, /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH3_COL_SELECT_INPUT = 195U,     /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH3_CRS_SELECT_INPUT = 196U,     /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH3_SLV_MDC_IN_SELECT_INPUT = 197U, /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH3_SLV_MDIO_IN_SELECT_INPUT = 198U, /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH4_COL_SELECT_INPUT = 199U,     /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH4_CRS_SELECT_INPUT = 200U,     /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH4_SLV_MDC_IN_SELECT_INPUT = 201U, /**< IOMUXC select input index */
    kIOMUXC_NETC_ETH4_SLV_MDIO_IN_SELECT_INPUT = 202U, /**< IOMUXC select input index */
    kIOMUXC_NETC_TMR_TRIG1_SELECT_INPUT = 203U,    /**< IOMUXC select input index */
    kIOMUXC_NETC_TMR_TRIG2_SELECT_INPUT = 204U,    /**< IOMUXC select input index */
    kIOMUXC_NETC_CLKGEN_IPP_TMR_CLK_SELECT_INPUT = 205U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH0_RX_CLK_SELECT_INPUT = 206U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH0_RX_DV_SELECT_INPUT = 207U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH0_RX_ER_SELECT_INPUT = 208U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH0_RXD_SELECT_INPUT_0 = 209U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH0_RXD_SELECT_INPUT_1 = 210U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH0_RXD_SELECT_INPUT_2 = 211U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH0_RXD_SELECT_INPUT_3 = 212U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH0_TX_CLK_SELECT_INPUT = 213U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH2_RX_CLK_SELECT_INPUT = 214U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH2_RX_DV_SELECT_INPUT = 215U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH2_RX_ER_SELECT_INPUT = 216U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH2_RXD_SELECT_INPUT_0 = 217U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH2_RXD_SELECT_INPUT_1 = 218U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH2_RXD_SELECT_INPUT_2 = 219U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH2_RXD_SELECT_INPUT_3 = 220U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH2_TX_CLK_SELECT_INPUT = 221U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH3_RX_CLK_SELECT_INPUT = 222U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH3_RX_DV_SELECT_INPUT = 223U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH3_RX_ER_SELECT_INPUT = 224U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH3_RXD_SELECT_INPUT_0 = 225U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH3_RXD_SELECT_INPUT_1 = 226U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH3_RXD_SELECT_INPUT_2 = 227U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH3_RXD_SELECT_INPUT_3 = 228U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH3_TX_CLK_SELECT_INPUT = 229U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH4_RX_CLK_SELECT_INPUT = 230U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH4_RX_DV_SELECT_INPUT = 231U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH4_RX_ER_SELECT_INPUT = 232U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH4_RXD_SELECT_INPUT_0 = 233U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH4_RXD_SELECT_INPUT_1 = 234U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH4_RXD_SELECT_INPUT_2 = 235U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH4_RXD_SELECT_INPUT_3 = 236U, /**< IOMUXC select input index */
    kIOMUXC_NETC_PINMUX_IPP_IND_ETH4_TX_CLK_SELECT_INPUT = 237U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER1_TMR0_INPUT_SELECT_INPUT = 238U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER1_TMR1_INPUT_SELECT_INPUT = 239U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER1_TMR2_INPUT_SELECT_INPUT = 240U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER2_TMR0_INPUT_SELECT_INPUT = 241U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER2_TMR1_INPUT_SELECT_INPUT = 242U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER2_TMR2_INPUT_SELECT_INPUT = 243U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER3_TMR0_INPUT_SELECT_INPUT = 244U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER3_TMR1_INPUT_SELECT_INPUT = 245U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER3_TMR2_INPUT_SELECT_INPUT = 246U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER4_TMR0_INPUT_SELECT_INPUT = 247U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER4_TMR1_INPUT_SELECT_INPUT = 248U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER4_TMR2_INPUT_SELECT_INPUT = 249U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER5_TMR0_INPUT_SELECT_INPUT = 250U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER5_TMR1_INPUT_SELECT_INPUT = 251U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER5_TMR2_INPUT_SELECT_INPUT = 252U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER6_TMR0_INPUT_SELECT_INPUT = 253U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER6_TMR1_INPUT_SELECT_INPUT = 254U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER6_TMR2_INPUT_SELECT_INPUT = 255U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER7_TMR0_INPUT_SELECT_INPUT = 256U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER7_TMR1_INPUT_SELECT_INPUT = 257U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER8_TMR0_INPUT_SELECT_INPUT = 258U, /**< IOMUXC select input index */
    kIOMUXC_QTIMER8_TMR1_INPUT_SELECT_INPUT = 259U, /**< IOMUXC select input index */
    kIOMUXC_SAI4_IPG_CLK_SAI_MCLK_SELECT_INPUT = 260U, /**< IOMUXC select input index */
    kIOMUXC_SAI4_IPP_IND_SAI_RXBCLK_SELECT_INPUT = 261U, /**< IOMUXC select input index */
    kIOMUXC_SAI4_IPP_IND_SAI_RXDATA_SELECT_INPUT_0 = 262U, /**< IOMUXC select input index */
    kIOMUXC_SAI4_IPP_IND_SAI_RXDATA_SELECT_INPUT_1 = 263U, /**< IOMUXC select input index */
    kIOMUXC_SAI4_IPP_IND_SAI_RXSYNC_SELECT_INPUT = 264U, /**< IOMUXC select input index */
    kIOMUXC_SAI4_IPP_IND_SAI_TXBCLK_SELECT_INPUT = 265U, /**< IOMUXC select input index */
    kIOMUXC_SAI4_IPP_IND_SAI_TXSYNC_SELECT_INPUT = 266U, /**< IOMUXC select input index */
    kIOMUXC_SINC1_IPP_IND_EMBIT_SELECT_INPUT_0 = 269U, /**< IOMUXC select input index */
    kIOMUXC_SINC1_IPP_IND_EMBIT_SELECT_INPUT_1 = 270U, /**< IOMUXC select input index */
    kIOMUXC_SINC1_IPP_IND_EMBIT_SELECT_INPUT_2 = 271U, /**< IOMUXC select input index */
    kIOMUXC_SINC1_IPP_IND_EMBIT_SELECT_INPUT_3 = 272U, /**< IOMUXC select input index */
    kIOMUXC_SINC1_IPP_IND_EMCLK_SELECT_INPUT_0 = 273U, /**< IOMUXC select input index */
    kIOMUXC_SINC1_IPP_IND_EMCLK_SELECT_INPUT_1 = 274U, /**< IOMUXC select input index */
    kIOMUXC_SINC1_IPP_IND_EMCLK_SELECT_INPUT_2 = 275U, /**< IOMUXC select input index */
    kIOMUXC_SINC1_IPP_IND_EMCLK_SELECT_INPUT_3 = 276U, /**< IOMUXC select input index */
    kIOMUXC_SINC2_IPP_IND_EMBIT_SELECT_INPUT_2 = 277U, /**< IOMUXC select input index */
    kIOMUXC_SINC2_IPP_IND_EMBIT_SELECT_INPUT_3 = 278U, /**< IOMUXC select input index */
    kIOMUXC_SINC2_IPP_IND_EMCLK_SELECT_INPUT_0 = 279U, /**< IOMUXC select input index */
    kIOMUXC_SINC2_IPP_IND_EMCLK_SELECT_INPUT_2 = 280U, /**< IOMUXC select input index */
    kIOMUXC_SINC2_IPP_IND_EMCLK_SELECT_INPUT_3 = 281U, /**< IOMUXC select input index */
    kIOMUXC_SPDIF_SPDIF_IN1_SELECT_INPUT = 282U,   /**< IOMUXC select input index */
    kIOMUXC_USB_IPP_IND_OTG2_OC_SELECT_INPUT = 285U, /**< IOMUXC select input index */
    kIOMUXC_USB_IPP_IND_OTG_OC_SELECT_INPUT = 286U, /**< IOMUXC select input index */
    kIOMUXC_USBPHY1_USB_ID_SELECT_INPUT = 287U,    /**< IOMUXC select input index */
    kIOMUXC_USBPHY2_USB_ID_SELECT_INPUT = 288U,    /**< IOMUXC select input index */
    kIOMUXC_USDHC1_IPP_CARD_DET_SELECT_INPUT = 289U, /**< IOMUXC select input index */
    kIOMUXC_USDHC1_IPP_WP_ON_SELECT_INPUT = 290U,  /**< IOMUXC select input index */
    kIOMUXC_USDHC2_IPP_CARD_DET_SELECT_INPUT = 291U, /**< IOMUXC select input index */
    kIOMUXC_USDHC2_IPP_WP_ON_SELECT_INPUT = 292U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_14 = 293U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_15 = 294U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_17 = 295U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_18 = 296U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_19 = 297U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_20 = 298U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_21 = 299U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_22 = 300U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_23 = 301U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_24 = 302U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_25 = 303U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_26 = 304U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_27 = 305U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_28 = 306U,  /**< IOMUXC select input index */
